# -*- coding: utf-8 -*-

# Создать модуль my_burger. В нем определить функции добавления инградиентов:
#  - булочки
#  - котлеты
#  - огурчика
#  - помидорчика
#  - майонеза
#  - сыра
# В каждой функции выводить на консоль что-то вроде "А теперь добавим ..."

# В этом модуле создать рецепт двойного чизбургера (https://goo.gl/zA3goZ)
# с помощью фукций из my_burger и вывести на консоль.

# Создать рецепт своего бургера, по вашему вкусу.
# Если не хватает инградиентов - создать соответствующие функции в модуле my_burger

import my_burger as mb

# TODO, Нейминг: смотрите, есть функция, которая добавляет сыр, называется она просто «сыр».
#  Давайте придумаем названия нашим функциям так, чтобы они отражали сущность функций. К примеру, "добавить_сыр".


mb.bun()
mb.ham()
mb.cheese()
mb.ham()
mb.cheese()
mb.cucumber()
mb.tomato()
mb.mayonnaise()
mb.bun()
